{
    "when will I receive my HELB loan disbursement?": "HELB disburses loans to students after confirming their enrolment status with their respective universities. Disbursement dates vary depending on the academic calendar of each university, but usually occur at the beginning of each semester. You can check the disbursement schedule on the HELB website or contact the HELB customer service center for more information.",
    "what are the requirements for applying for a HELB loan?": "To be eligible for a HELB loan, you must be a Kenyan citizen, be enrolled in an accredited institution of higher learning in Kenya, and demonstrate financial need. You will need to provide documentation such as your ID card, admission letter, and academic transcripts, as well as complete an online application form. You can find more information on the HELB website or contact the HELB customer service center for assistance with your application.",
    "how do I repay my HELB loan?": "HELB loans have a grace period of one year after graduation or completion of studies, after which you will be required to start repaying the loan. You can make repayments through various channels such as M-PESA, bank deposits, or salary deductions. You will receive a repayment schedule after graduation or completion of studies that outlines the repayment amount, interest rate, and repayment period. You can find more information on the HELB website or contact the HELB customer service center for assistance with your loan repayment.",
    "I have a question about my HELB loan application status.": "To check the status of your HELB loan application, you can log in to your HELB account on the HELB website or contact the HELB customer service center. You will need to provide your application ID number and other identifying information. If your application is incomplete or requires additional documentation, you will be notified via email or SMS. You can find more information on the HELB website or contact the HELB customer service center for assistance with your loan application."
}
